-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: high_grass
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `user_name` varchar(20) NOT NULL,
  `user_password` varchar(20) NOT NULL,
  `user_email` varchar(20) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;

--
-- Table structure for table `plantinfo`
--

DROP TABLE IF EXISTS `plantinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `plantinfo` (
  `PlantID` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(100) NOT NULL,
  `Family` varchar(100) NOT NULL,
  `Genus` varchar(100) NOT NULL,
  `Species` varchar(100) NOT NULL,
  `Distribution` varchar(255) NOT NULL,
  `Appearance` text,
  `MedicinalValue` text,
  PRIMARY KEY (`PlantID`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `plantinfo`
--

/*!40000 ALTER TABLE `plantinfo` DISABLE KEYS */;
INSERT INTO `plantinfo` VALUES (1,'暗紫贝母','百合科','贝母属','暗紫贝母 ','四川西北部、青海东南部','多年生草本植物。鳞茎深埋土中，外有鳞茎皮，鳞茎由2枚鳞片组成，茎生叶最下面2枚相对生长，上面叶互生或兼对生长，形状呈线形或线状披针形 ','清热润肺；化痰止咳；散结消肿。主肺虚；久咳；虚劳咳嗽；燥热咳嗽；肺痈；瘰疬；痈肿；乳痈'),(3,'百日菊','菊科','百日草属','百日菊','云南（西双版纳、蒙自等）、四川西南部','茎直立，叶宽卵圆形或长圆状椭圆形','全草治上感发热，口腔炎，风火牙痛'),(4,'北方拉拉藤','茜草科','拉拉藤属','北方拉拉藤','黑龙江、吉林、辽宁、内蒙古、河北、山西、甘肃、青海、新疆、山东、四川、西藏等省区','直立草本，无毛或有极短的毛，叶纸质或薄革质','止咳祛痰、祛湿止痛'),(5,'变色苦荬菜','菊科','苦荬菜属','中华苦荬菜','黑龙江，吉林，内蒙古，河北，山西等地','根垂直或弯曲，茎低矮，主茎不明显','热解毒、利湿消痞、去腐化脓、止血生肌'),(6,'川西小黄菊','菊科','菊蒿属','川西小黄菊','中国青海西南部、四川西南部及西北部、云南西北部及西藏东部','多年生草本，茎单生或少数茎成簇生，不分枝，有弯曲的长单毛，上部及接头状花序处的毛稠密','活血、祛湿、消炎止痛'),(7,'大丽花','菊科','大丽花属','大丽花','甘肃省，辽宁省，广东省为主要栽培产地','茎多分枝，叶一至三回羽状全裂，上部叶有时不裂，裂片卵形或长圆状卵形，下面灰绿色，两面无毛','清热解毒、散瘀止痛'),(8,'淡黄香青','菊科','香青属','淡黄香青','青海、甘肃、陕西、四川西部及西藏东部和南部','根状茎稍细长，莲座状叶倒披针状长圆形','清热燥湿'),(9,'鹅绒藤','夹竹桃科','鹅绒藤属','鹅绒藤','中国辽宁、河北、河南、山东、山西、陕西、宁夏、甘肃、江苏、浙江等省区','缠绕草本，主根圆柱状，全株被短柔毛，叶对生，薄纸质，宽三角状心形','清热解毒，消积健胃，利水消肿'),(10,'甘肃贝母','百合科','贝母属','甘肃贝母','中国甘肃南部、青海东部和南部和四川西部','多年生草本；鳞茎深埋土中，外有鳞茎皮，叶通常最下面的2枚对生，上面的2-3枚散生，条形','清热润肺，止咳化痰'),(11,'高原点地梅','报春花科','点地梅属','高原点地梅','西藏东南部、四川西部、云南西北部和青海南部','多年生草本，植株由多数根出条和莲座状叶丛形成密丛或垫状体，根出条稍粗壮，深褐色','渗湿利水'),(12,'褐毛垂头菊','菊科','垂头菊属','褐毛垂头菊','西藏东北部、四川西北部、青海南部、甘肃西南部','多年生草本，全株灰绿色或蓝绿色。根肉质，粗壮，多数。茎单生，直立，丛生叶多达7枚，与茎下部叶均具宽柄','清热凉血'),(13,'红花岩生忍冬','忍冬科','忍冬属','岩生忍冬','中国宁夏南部、甘肃西北部至南部、青海东部、四川西南部至西北部、云南西北部及西藏','落叶灌木，幼枝和叶柄均被屈曲、白色短柔毛和微腺毛，或有时近无毛，叶纸质，很少对生，条状披针形、矩圆状披针形至矩圆形','清热解毒。主温病发热'),(14,'戟叶火绒草','菊科','火绒草属','戟叶火绒草','中国陕西南部、甘肃、四川、西藏东部、云南、贵州、湖南西部','多年生草本，根状茎分枝短缩，茎直立或有膝曲的基部，下部有密集的、上部有疏散的叶','清热解毒、舒筋活络、润肺补气'),(15,'箭叶橐吾','菊科','橐吾属','箭叶橐吾','内蒙自治区，河北省，山西省，陕西省，宁夏回族自治区，甘肃省，青海省，四川省，西藏自治区','多年生草本。根肉质，细而多,茎直立,丛生叶与茎下部叶具柄','消肿止痛、涌吐'),(16,'苣荬菜','菊科','苣荬菜属','苣荬菜','宁夏、新疆、湖北、云南、贵州等','多年生草本植物，根垂直直伸，多少有根状茎，须根多数，茎直立，基生叶多数，与中下部茎叶全形倒披针形或长椭圆形，羽状或倒向羽状深裂、半裂或浅裂','消热解毒、凉血、利湿、消肿排脓、祛瘀止痛、补虚止咳'),(17,'康藏荆芥','唇形科','荆芥属','康藏荆芥','西藏东部，四川西部，青海西部，甘肃南部，陕西南部，山西及河北北部','多年生草本，茎呈四棱形，具细条纹，被倒向短硬毛或变无毛，叶卵状披针形、宽披针形至披针形','疏风，解表，利湿，止血，止痛'),(18,'款冬','菊科','款冬属','款冬','中国分布于东北、华北、华东、西北和湖北、湖南、江西、贵州、云南和西藏','多年生草本，根状茎横生地下，褐色，有鳞片状，互生的苞叶，苞叶淡紫色','润肺下气，止咳化痰'),(19,'葵花大蓟','菊科','蓟属','葵花大蓟','甘肃、青海、四川及西藏等','多年生铺散草本。主根粗壮，直伸，生多数须根。茎基粗厚，无主茎，全部叶基生，莲座状，长椭圆形、椭圆状披针形或倒披针形，羽状浅裂、半裂、深裂至几全裂','凉血，散瘀消肿'),(20,'拉萨狗娃花','菊科','紫菀属','拉萨狗娃花','西藏，锡金','一年生草本，有直根，茎自基部具铺散的分枝或直立而在中下部起分枝，纤细，被平贴的糙伏毛或开展的短硬毛并混有腺毛','解毒消肿，治疮肿、蛇咬'),(21,'蓝白龙胆','龙胆科','龙胆属','蓝白龙胆','中国西藏、四川、青海、甘肃、新疆','一年生草本，茎黄绿色，光滑，在基部多分枝，枝铺散，斜升，叶稍大，基生卵圆形或卵状椭圆形','保肝、利胆、健胃、抗炎'),(22,'蓝钟花','桔梗科','蓝钟花属','蓝钟花','西藏东部、云南北部、四川西部、青海南部和甘肃东南部','一年生草本。茎通常数条丛生，近直立或上升，基部生淡褐黄色柔毛或无毛，有短分枝，叶片菱形、菱状三角形或卵形','缓泻'),(23,'狸藻','狸藻科','狸藻属','狸藻','黑龙江、吉林、辽宁、内蒙古、宁夏、河北、山西、陕西、甘肃、青海、新疆、山东、河南、四川（西北部）和西藏。','水生草本植物。匍匐枝圆柱形，叶器多数，互生，2裂达基部，裂片轮廓呈卵形、椭圆形或长圆状披针形，','内脏出血和慢性支气管炎'),(24,'蓼子朴','菊科','旋覆花属','蓼子朴','北京、辽宁、内蒙古、河北、山西、陕西、甘肃、青海、新疆','亚灌木，地下茎分枝长，横走，木质，有疏生膜质尖披针形。茎平卧，或斜升，或直立，圆柱形，下部木质。','味辛性凉，有解热、利尿的功能'),(25,'鳞叶龙胆','龙胆科','龙胆属','鳞叶龙胆','西南（除西藏）、西北、华北及东北','一年生矮小草本植物。茎黄绿色或紫红色，密被黄绿色或杂有紫色乳突，基部多分枝，枝铺散，斜升；叶缘厚软骨质，先端钝圆或急尖，具短小尖头。','味苦、辛，性寒，有清热利湿、解毒消痈之功效'),(26,'轮叶黄精','天门冬科','黄精属','轮叶黄精','西藏（东部和南部）、云南（西北部）、四川（西部）、青海（东北部）、甘肃（东南部）、陕西（南部）、山西（西部）','具根状茎草本。根状茎的“节间”长2-3厘米，一头粗，一头较细，叶通常为3叶轮生，或间有少数对生或互生的，少有全株为对生的。','平肝熄风、补肾、润肺'),(27,'美头火绒草','菊科','火绒草属','美头火绒草','青海东部、甘肃西部至南部、四川北部至西南部、云南西北部至北部','多年生草本。根状茎稍细，横走，颈部粗厚，不育茎被密集的叶鞘，有顶生的叶丛，与1至数个花茎簇生。茎从膝曲的基部直立，不分枝。','治风湿病'),(28,'密生波罗花','紫葳科','角蒿属','密生波罗花','肃南部、青海、四川西部、云南西北部、西藏','多年生草本植物，叶为1回羽状复叶、聚生于茎基部，顶端渐尖，基部圆形，顶端小叶近卵圆形，比侧生小叶较大，全缘。','治胃病、黄疽、消化不良、耳炎、耳聋、月经不调、高血压、肺出血。'),(29,'千里香杜鹃','杜鹃花科','杜鹃花属','千里香杜鹃','甘肃、青海、四川北部及西北部','常绿直立小灌木，分枝多而细瘦，疏展或成帚状。枝条纤细，灰棕色，无毛，密被暗色鳞片。叶芽鳞脱落。叶常聚生于枝顶，近革质，椭圆形、长圆形、窄倒卵形至卵状披针形。','祛痰平喘'),(30,'忍冬','忍冬科','忍冬属','忍冬','除黑龙江、内蒙古、宁夏、青海、新疆、海南和西藏无自然生长外，全国各省均有分布。','半常绿藤本，幼枝暗红褐色，密被硬直糙毛、腺毛和柔毛，下部常无毛，叶纸质，卵形或长圆状卵形，有时卵状披针形，稀圆卵状或倒卵形，极少有1至数个钝缺刻，','清热解毒、疏散风热'),(31,'日本毛连菜','菊科','毛连菜属','日本毛连菜','黑龙江、吉林、辽宁、内蒙古、河北、山西、陕西、甘肃、青海、新疆、山东、安徽、河南、四川、贵州、云南、西藏','多年生草本，根垂直直伸，有少数侧根。茎直立，有纵沟纹，基部有时稍带紫红色，上部伞房状或伞房圆锥状分枝，全部茎枝被稠密或稀疏的钩状的硬毛，硬毛黑色或黑绿色。基生叶花期枯萎，脱落；下部茎叶倒披针形、椭圆状披针形或椭圆状倒披针形','清热、消肿及止痛'),(32,'乳苣','菊科','莴苣属','乳苣','辽宁、内蒙古、河北、山西、陕西、甘肃、青海、新疆、河南、西藏','多年生草本，根垂直直伸。茎直立，有细条棱或条纹，上部有圆锥状花序分枝，全部茎枝光滑无毛。中下部茎叶长椭圆形或线状长椭圆形或线形，基部渐狭成短柄，羽状浅裂或半裂或边缘有多数或少数大锯齿，顶端钝或急尖','清热、解毒、活血、排脓'),(33,'锐果鸢尾','鸢尾科','鸢尾属','锐果鸢尾','陕西、甘肃、青海、四川、云南、西藏','多年生草本植物，根状茎短，棕褐色；须根细，质地柔嫩，黄白色，多分枝。叶柔软，黄绿色，条形，长10-25厘米，宽2-3毫米，顶端钝，中脉不明显。','清热解毒、凉血利湿'),(34,'少花顶冰花','百合科','顶冰花属','少花顶冰花','黑龙江、内蒙古、宁夏、河北、陕西、甘肃、青海和西藏','全株多少有微柔毛，下部尤其明显。鳞茎狭卵形，上端延伸成圆筒状，多少撕裂，抱茎。基生叶1枚，通常脉上和边缘疏生微柔毛','清心'),(35,'唐菖蒲','鸢尾科','唐菖蒲属','唐菖蒲','广东、四川、福建、吉林、辽宁、云南、上海、甘肃、江苏、深圳和河北','多年生草本。球茎扁圆球形，外包有棕色或黄棕色的膜质包被。叶基生或在花茎基部互生，剑形','清热解毒、散瘀消肿'),(36,'天蓝韭','石蒜科','葱属','天蓝韭','陕西、宁夏、甘肃、青海、西藏、四川和湖北','鳞茎数枚聚生，圆柱状，细长，鳞茎外皮暗褐色，老时破裂成纤维状，常呈不明显的网状。叶半圆柱状，上面具沟槽，比花葶短或超过花葶','散寒解表，温中益胃，散瘀止痛'),(37,'天山千里光','菊科','千里光属','天山千里光','新疆、甘肃、内蒙、四川、西藏','矮小根状茎草本。茎单生或数个簇生，上升或直立，不分枝或有时自基部分枝，幼时被疏蛛丝状毛，后或多或少脱毛。基生叶和下部茎叶在花期生存，具梗；叶片倒卵形或匙形','止咳平喘，健脾消食，下乳'),(38,'万寿菊','菊科','万寿菊属','万寿菊','中国各地均有栽培','茎直立，粗壮，具纵细条棱，分枝向上平展 。叶对生或互生，羽状全裂，有油腺，夏秋季开花，头状花序顶生，花冠外围是舌状花，单性花','可治痈、疮、疳、疔、无名肿毒'),(39,'微孔草','紫草科','微孔草属','微孔草','陕西西南部，甘肃、青海、四川西部、云南西北部、西藏东部和南部','茎直立或渐升，常自基部起有长或短的分枝，或不分枝，被刚毛，有时还混生稀疏糙伏毛。基生叶和茎下部叶具长柄，卵形、狭卵形至宽披针形，顶端急尖、渐尖，稀钝','可治疗眼疾、痘疹'),(40,'萎软紫菀','菊科','紫菀属','萎软紫菀','中国北部、西北部、西部、西南部、新疆及西藏','多年生草本，根状茎细长，有时具匍枝。茎直立，不分枝，被皱曲或开展的长毛，上部常杂有具柄腺毛，或仅有腺毛或腺毛，下部有密集的叶。','清热解毒，止咳'),(41,'莴苣','菊科','莴苣属','莴苣','中国各地都有栽培','一年生或二年草本植物，根垂直直伸，茎直立，粗壮，嫩时呈棍棒状，光滑无毛，灰白色，含乳汁；老时上部分开花，单生，上部圆锥状花序分枝，全部茎枝白色。','活血、通乳'),(42,'喜马拉雅沙参','桔梗科','沙参属','喜马拉雅沙参','新疆、西藏、四川、青海、甘肃','多年生草本，有白色乳汁。根胡萝卜状，根细，常稍稍加粗，最粗只达到近1厘米。茎常数支发自一条茎基上，不分枝，通常无毛，少数有倒生短毛，极个别有倒生长毛，基生叶心形或近于三角形卵形；茎生叶卵状披针形，狭椭圆形至条形，无柄或有时茎下部的叶具短柄','养阴清热；润肺化痰；益胃生津。主阴虚久咳；痨嗽痰血；燥咳痰少；虚热喉痹；津伤口渴'),(43,'细叶假还阳参','菊科','假还阳参属','细叶假还阳参','北京、黑龙江、吉林、辽宁、内蒙古、河北、新疆、西藏','多年生 草本，主茎粗短，木质化，多分枝；基生叶匙形，莲座状簇生，茎生叶小，披针形；头状 花序 复排列为 伞房花序 总苞圆筒形，花舌状，小花10朵左右，黄色；瘦果扁，近圆柱状，有纵肋， 冠 毛白色。','清肠排毒、消炎杀菌'),(44,'星舌紫菀','菊科','紫菀属','星舌紫菀','西藏、四川、青海、云南','多年生草本，根状茎短，上端有数个簇生的莱菔状向下渐细的块根。茎常单生，纤细，紫色或下部绿色，被开展的毛和紫色腺毛，中部以上或上部常无叶。','清热解毒，降血压'),(45,'星状雪兔子','菊科','风毛菊属','星状雪兔子','中国甘肃、青海、四川、云南、西藏','根倒圆锥状，深褐色。叶莲座状，星状排列，线状披针形，无柄，中部以上长渐尖，向基部常卵状扩大，边缘全缘，两面同色，紫红色或近基部紫红色，或绿色，无毛','解毒疗疮、祛风除湿。疥疮肿毒、发热、红肿疼痛、风湿痹证、四肢麻木'),(46,'旋覆花','菊科','旋覆花属','旋覆花','中国北部、东北部、中部、东部各省，极常见，在四川、贵州、福建、广东也可见到','多年生草本。根状茎短，横走或斜升，有多少粗壮的须根。茎单生，有时基部具不定根，有细沟，被长伏毛，或下部有时脱毛，上部有上升或开展的分枝，全部有叶','降气、消痰、行水、止呕'),(47,'烟草','茄科','烟草属','烟草','中国南北各省区广为栽培','一年生或有限多年生草本，全体被腺毛；根粗壮。茎基部稍木质化。叶矩圆状披针形、披针形、矩圆形或卵形，顶端渐尖，基部渐狭至茎成耳状而半抱茎','消肿、解毒、杀虫'),(48,'野鸢尾','鸢尾科','鸢尾属','野鸢尾','黑龙江、吉林、辽宁、内蒙古、河北、山西、山东、河南、安徽、江苏、江西、陕西、甘肃、宁夏、青海','野鸢尾是多年生草本植物。根状茎为不规则的块状，棕褐色或黑褐色；须根发达，粗而长，黄白色，分枝少。叶基生或在花茎基部互生，两面灰绿色，剑形，长15-35厘米，宽1.5-3厘米，顶端多弯曲呈镰刀形，渐尖或短渐尖，基部鞘状抱茎，无明显的中脉。','消积，破瘀，行水，解毒'),(49,'益母草','唇形科','益母草属','益母草','在中国分布于全国各地','一年生或二年生草本，有于其上密生须根的主根。茎直立，钝四棱形，微具槽，有倒向糙伏毛，在节及棱上尤为密集，在基部有时近于无毛，多分枝，或仅于茎中部以上有能育的小枝条。叶轮廓变化很大，茎下部叶轮廓为卵形，基部宽楔形，掌状3裂，裂片呈长圆状菱形至卵圆形','活血祛瘀、调经消水'),(50,'掌裂兰','兰科','掌裂兰属','掌裂兰','黑龙江、吉林、内蒙古、宁夏、甘肃、青海、新疆、四川西部和西藏东部','块茎肉质，下部3-5掌状分裂；茎粗壮，中空，具4-6叶。叶互生，长圆形、长圆状椭圆形、披针形或线状披针形，上面无紫斑，长8-15厘米，基部鞘状抱茎','补肾益精、生津止咳'),(51,'中国马先蒿','列当科','马先蒿属','中国马先蒿','青海东北部、甘肃南部和中部、山西与河北北部','一年生，低矮或多少升高，主根圆锥形，有少数支根，长达8厘米。茎单出或多条，直立或外方者弯曲上升或甚至倾卧，有深沟纹，有成行的毛或几光滑，有时上部偶有分枝。叶基出与茎生，均有柄','味平，主寒热，鬼注，中风湿痹'),(52,'帚状鸦葱','菊科','鸦葱属','帚状鸦葱','陕西、宁夏、甘肃、青海、新疆','多年生草本，根垂直直伸，茎自中部以上分枝，分枝纤细或较粗，长或短，成帚状，极少不分枝；全部茎枝被尘状短柔毛或稀毛至无毛，茎基被纤维状撕裂的残鞘，极少残鞘全缘，不裂。叶互生或植株含有对生的叶序，线形，向上的茎生叶渐短或全部茎生叶短小或极短小而几成针刺状或鳞片状，','消肿，解毒');
/*!40000 ALTER TABLE `plantinfo` ENABLE KEYS */;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `user_name` varchar(20) NOT NULL,
  `user_password` varchar(20) NOT NULL,
  `user_email` varchar(20) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'lidonghang','123456','1766387985@qq.com'),(2,'duyafeng','123456','1073592473@qq.com'),(4,'jinlisha','123456','3312424890@qq.com'),(5,'wangyuxin','123456','1766387985@qq.com');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;

--
-- Dumping routines for database 'high_grass'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-28 20:39:44
